# AreElementsValidForMultiReferenceAnnotation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotation..::..AreElementsValidForMultiReferenceAnnotation Method
MultiReferenceAnnotation Class See Also
---
The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static bool AreElementsValidForMultiReferenceAnnotation(
	Document document,
	MultiReferenceAnnotationOptions options
)
```

Visual Basic
---
```text
Public Shared Function AreElementsValidForMultiReferenceAnnotation ( _
	document As Document, _
	options As MultiReferenceAnnotationOptions _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreElementsValidForMultiReferenceAnnotation(
	Document^ document,
	MultiReferenceAnnotationOptions^ options
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document for the multi-reference annotation.
options
    Type: Autodesk.Revit.DB..::..MultiReferenceAnnotationOptions The creation options for the new MultiReferenceAnnotation.
# ### Return Value
Returns true if the input elements match the element category id for the MultiReferenceAnnotationType, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace